results-petclinic-harness_2_0_0-jvm-g1gc-run/result-2026-01-05-22:43:25/wrk2_results_20260105_224333.txt
Running 30s test @ http://petclinic:8006
  16 threads and 16 connections
  Thread calibration: mean lat.: 546.600ms, rate sampling interval: 2402ms
  Thread calibration: mean lat.: 448.210ms, rate sampling interval: 1974ms
  Thread calibration: mean lat.: 599.472ms, rate sampling interval: 2471ms
  Thread calibration: mean lat.: 452.839ms, rate sampling interval: 2271ms
  Thread calibration: mean lat.: 511.759ms, rate sampling interval: 2213ms
  Thread calibration: mean lat.: 423.740ms, rate sampling interval: 2079ms
  Thread calibration: mean lat.: 552.532ms, rate sampling interval: 2521ms
  Thread calibration: mean lat.: 465.105ms, rate sampling interval: 2177ms
  Thread calibration: mean lat.: 469.702ms, rate sampling interval: 2308ms
  Thread calibration: mean lat.: 478.791ms, rate sampling interval: 2295ms
  Thread calibration: mean lat.: 551.398ms, rate sampling interval: 2625ms
  Thread calibration: mean lat.: 443.239ms, rate sampling interval: 2232ms
  Thread calibration: mean lat.: 505.693ms, rate sampling interval: 2181ms
  Thread calibration: mean lat.: 410.476ms, rate sampling interval: 2109ms
  Thread calibration: mean lat.: 436.542ms, rate sampling interval: 2260ms
  Thread calibration: mean lat.: 514.466ms, rate sampling interval: 2527ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.52ms    0.96ms  20.77ms   93.06%
    Req/Sec   187.02      0.15   188.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.35ms
 75.000%    1.65ms
 90.000%    2.18ms
 99.000%    5.84ms
 99.900%   10.72ms
 99.990%   14.60ms
 99.999%   17.30ms
100.000%   20.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.509     0.000000            1         1.00
       0.836     0.100000         5999         1.11
       0.979     0.200000        12003         1.25
       1.110     0.300000        17951         1.43
       1.237     0.400000        23931         1.67
       1.354     0.500000        29923         2.00
       1.411     0.550000        32898         2.22
       1.471     0.600000        35895         2.50
       1.528     0.650000        38885         2.86
       1.586     0.700000        41902         3.33
       1.653     0.750000        44855         4.00
       1.695     0.775000        46351         4.44
       1.748     0.800000        47836         5.00
       1.813     0.825000        49326         5.71
       1.900     0.850000        50827         6.67
       2.020     0.875000        52320         8.00
       2.097     0.887500        53083         8.89
       2.181     0.900000        53823        10.00
       2.281     0.912500        54565        11.43
       2.401     0.925000        55305        13.33
       2.553     0.937500        56061        16.00
       2.639     0.943750        56431        17.78
       2.757     0.950000        56801        20.00
       2.923     0.956250        57173        22.86
       3.119     0.962500        57546        26.67
       3.401     0.968750        57921        32.00
       3.571     0.971875        58107        35.56
       3.785     0.975000        58295        40.00
       4.025     0.978125        58481        45.71
       4.327     0.981250        58667        53.33
       4.799     0.984375        58854        64.00
       5.039     0.985938        58948        71.11
       5.335     0.987500        59041        80.00
       5.663     0.989062        59135        91.43
       6.039     0.990625        59228       106.67
       6.539     0.992188        59321       128.00
       6.799     0.992969        59368       142.22
       7.143     0.993750        59415       160.00
       7.531     0.994531        59462       182.86
       7.991     0.995313        59508       213.33
       8.343     0.996094        59555       256.00
       8.655     0.996484        59578       284.44
       8.919     0.996875        59602       320.00
       9.239     0.997266        59625       365.71
       9.503     0.997656        59649       426.67
       9.759     0.998047        59672       512.00
       9.943     0.998242        59684       568.89
      10.183     0.998437        59695       640.00
      10.415     0.998633        59707       731.43
      10.519     0.998828        59718       853.33
      10.735     0.999023        59730      1024.00
      10.951     0.999121        59736      1137.78
      11.175     0.999219        59742      1280.00
      11.383     0.999316        59748      1462.86
      11.623     0.999414        59753      1706.67
      11.879     0.999512        59759      2048.00
      12.631     0.999561        59762      2275.56
      12.743     0.999609        59765      2560.00
      13.007     0.999658        59768      2925.71
      13.159     0.999707        59771      3413.33
      13.423     0.999756        59775      4096.00
      13.423     0.999780        59775      4551.11
      13.631     0.999805        59777      5120.00
      13.807     0.999829        59778      5851.43
      14.415     0.999854        59780      6826.67
      14.543     0.999878        59781      8192.00
      14.599     0.999890        59782      9102.22
      14.679     0.999902        59783     10240.00
      14.679     0.999915        59783     11702.86
      14.719     0.999927        59784     13653.33
      16.007     0.999939        59785     16384.00
      16.007     0.999945        59785     18204.44
      16.591     0.999951        59786     20480.00
      16.591     0.999957        59786     23405.71
      16.591     0.999963        59786     27306.67
      17.295     0.999969        59787     32768.00
      17.295     0.999973        59787     36408.89
      17.295     0.999976        59787     40960.00
      17.295     0.999979        59787     46811.43
      17.295     0.999982        59787     54613.33
      20.783     0.999985        59788     65536.00
      20.783     1.000000        59788          inf
#[Mean    =        1.520, StdDeviation   =        0.956]
#[Max     =       20.768, Total count    =        59788]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89819 requests in 29.85s, 12.08MB read
Requests/sec:   3009.11
Transfer/sec:    414.53KB

--- RESPONSE STATUS HISTOGRAM ---
Total requests: 89819
Total errors (4xx/5xx): 0
Threads aggregated: 16

Status code distribution:
  302:    89819 (100.00%) ██████████████████████████████████████████████████

Histogram data written to: /wrktemp/results/response_histogram.json